<a href="https://colab.research.google.com/github/kirubanath/AI-DS_learnings/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

## Exercises:

First create a table called students. It has the columns: 'student_id', 'name', 'major', 'gpa' and 'enrollment_date' We will use a new form of `CREATE TABLE` expression to produce this table.

Note that you can improve this and are welcome to do so -- e.g. by specifying for example a PRIMARY KEY and a FOREIGN KEY in Q2 :)

    CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";


## Q1 Simple SELECTS (on the students table)
1. SELECT all records in the table.
2. SELECT students whose major is "Computer Science".
3. SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).
4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.


## Q2 Joins

Create a new table called courses, which indicates the courses taken by the students. 

Create the table by running:
	
    CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";

1. COUNT the number of unique courses.
2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.
3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.


## Q3 Aggregate functions, numerical logic and grouping

1. Find the average gpa of all students.
2. SELECT the student with the maximum gpa, display only their student_id, major and gpa
3. SELECT the student with the minimum gpa, display only their student_id, major and gpa
4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
5. Group the students by their major and retrieve the average grade of each major.
6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

# Your solution

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
#creating a student database
connection  = sqlite3.connect('student.db')

In [ ]:
cursor = connection.cursor()

## Q1:

In [ ]:
#creating the first table:

sql_c1 = """
CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";
"""

In [ ]:
#clearing the database
cursor.execute("DROP TABLE IF EXISTS Students")

In [ ]:
#creating the students table:
cursor.execute(sql_c1)

**1. Select all records in the table:**

In [ ]:
pd.read_sql_query('SELECT * FROM Students', con = connection, index_col= 'student_id')

                name             major  gpa enrollment_date
student_id
1               John  Computer Science  3.5      01-01-2022
2               Jane           Physics  3.8      01-02-2022
3                Bob       Engineering  3.0      01-03-2022
4           Samantha           Physics  3.9      01-04-2022
5              James       Engineering  3.7      01-05-2022
6              Emily  Computer Science  3.6      01-06-2022
7            Michael  Computer Science  3.2      01-07-2022
8            Jessica       Engineering  3.8      01-08-2022
9              Jacob           Physics  3.4      01-09-2022
10            Ashley           Physics  3.9      01-10-2022

**2. Select all students whose major is Computer Science**

In [ ]:
sql_c ="""
SELECT student_id, name, major FROM Students
WHERE major = 'Computer Science' COLLATE NOCASE;
"""
pd.read_sql_query(sql_c, connection)

   student_id     name             major
0           1     John  Computer Science
1           6    Emily  Computer Science
2           7  Michael  Computer Science

**3. SELECT all unique majors and order them by name, descending order.**

In [ ]:
sql_c ="""
SELECT DISTINCT major FROM Students
ORDER BY major DESC;
"""
pd.read_sql_query(sql_c, connection)

              major
0           Physics
1       Engineering
2  Computer Science

**4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.**

In [ ]:
sql_c ="""
SELECT name,gpa FROM Students
WHERE name LIKE '%e%'
ORDER BY gpa;
"""
pd.read_sql_query(sql_c, connection)

      name  gpa
0  Michael  3.2
1    Emily  3.6
2    James  3.7
3     Jane  3.8
4  Jessica  3.8
5   Ashley  3.9

## Q2:

In [ ]:
sql_c = """
CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";
"""

cursor.execute(sql_c)

OperationalError: table courses already exists

In [ ]:
pd.read_sql_query('SELECT * FROM courses', connection)

   course_id         course_name  student_id grade
0          1  Python programming           1     A
1          1  Python programming           4     A
2          1  Python programming           6     F
3          2     Data Structures           2     B
4          2     Data Structures           7     C
5          2     Data Structures          10     F
6          3    Database Systems           3     B
7          3    Database Systems           8     A
8          4   Quantum Mechanics           5     C
9          4   Quantum Mechanics           9     A

**1. COUNT the number of unique courses.**

In [ ]:
sql_c = """
SELECT count(DISTINCT course_id) as num_of_unique FROM courses
"""
pd.read_sql_query(sql_c, connection)

   num_of_unique
0              4

**2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.**

In [ ]:
sql_c = """
SELECT count(*) AS num_of_students
FROM students JOIN courses
ON students.student_id = courses.student_id
WHERE students.major = 'Computer Science' AND courses.course_name = 'Python programming' 

"""
pd.read_sql_query(sql_c, connection)

   num_of_students
0                2

**3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.**

In [ ]:
sql_c = """
SELECT students.name, students.major, students.gpa, courses.course_name, courses.grade
FROM students JOIN courses
ON students.student_id = courses.student_id
WHERE courses.grade < 'C' 
ORDER BY courses.grade, students.name
"""
pd.read_sql_query(sql_c, connection)

       name             major  gpa         course_name grade
0     Jacob           Physics  3.4   Quantum Mechanics     A
1   Jessica       Engineering  3.8    Database Systems     A
2      John  Computer Science  3.5  Python programming     A
3  Samantha           Physics  3.9  Python programming     A
4       Bob       Engineering  3.0    Database Systems     B
5      Jane           Physics  3.8     Data Structures     B

## Q3:

**1. Find the average gpa of all students.**

In [ ]:
sql_c = """
SELECT AVG(gpa) as avg_gpa
FROM students 
"""
pd.read_sql_query(sql_c, connection)

   avg_gpa
0     3.58

**2. SELECT the student with the maximum gpa, display only their student_id, major and gpa**

In [ ]:
sql_c = """
SELECT student_id, major, gpa 
FROM students 
WHERE gpa = (SELECT MAX(gpa) FROM students)
"""
pd.read_sql_query(sql_c, connection)

   student_id    major  gpa
0           4  Physics  3.9
1          10  Physics  3.9

**3. SELECT the student with the minimum gpa, display only their student_id, major and gpa**

In [ ]:
sql_c = """
SELECT student_id, major, gpa 
FROM students 
WHERE gpa  = (SELECT MIN(gpa) FROM students)
"""
pd.read_sql_query(sql_c, connection)

   student_id        major  gpa
0           3  Engineering  3.0

**4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa**

In [ ]:
sql_c = """
SELECT student_id, major, gpa 
FROM students 
WHERE (gpa > 3.6) AND (major = 'Physics' OR major = 'Engineering')
"""
pd.read_sql_query(sql_c, connection)

   student_id        major  gpa
0           2      Physics  3.8
1           4      Physics  3.9
2           5  Engineering  3.7
3           8  Engineering  3.8
4          10      Physics  3.9

**5. Group the students by their major and retrieve the average grade of each major.**

In [ ]:
sql_c = """
SELECT major, AVG(gpa) as avrage_grade
FROM students
GROUP BY major
"""
pd.read_sql_query(sql_c, connection)

              major  avrage_grade
0  Computer Science      3.433333
1       Engineering      3.500000
2           Physics      3.750000

**6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order**

In [ ]:
sql_c = """
WITH top2 as 
(select *,row_number() OVER(PARTITION BY major ORDER BY gpa DESC) as rn FROM students)

SELECT name,major,gpa
FROM top2
WHERE rn <=2
ORDER BY major, gpa DESC
"""
pd.read_sql_query(sql_c, connection)

       name             major  gpa
0     Emily  Computer Science  3.6
1      John  Computer Science  3.5
2   Jessica       Engineering  3.8
3     James       Engineering  3.7
4  Samantha           Physics  3.9
5    Ashley           Physics  3.9